# Student Activities - Lesson One

1. Use Pandas to load the Titanic dataset and describe the summary data for all columns

2. We don't need the column **Unnamed: 0**, in the previous exercises we demonstrated how to remove the column using the **del** command.  How else could we remove this column, without using **del**?

3. Compute the mean standard deviation, minimum and maximum values for the columns of the dataframe **without** using **describe**

4. What about the 33, 66 and 99% quartiles? How would we get these values using the individual method? As a hint the method quantile is the one to call (https://pandas.pydata.org/pandas-docs/stable/reference/frame.html )`

5. How many passengers were from each class?  Answer using the *groupby* method:

6. How many passengers were from each class?  Answer by using selecting / indexing methods to count the members of each class:

7. Confirm the answers to 5 & 6 match
8. Determine who was the eldest passenger in the 3rd class?:

9. For a number of machine learning problems it is very common to scale the numerical values between 0 and 1.  Use the agg method with lambda functions to scale the fare and age columns between 0 and 1.

10. There is one individual in the dataset without a listed Fare.

In [25]:
df_nan_fare = df.loc[(df.Fare.isna())]
df_nan_fare

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
1043,NaN,S,NaN,3,3701,60.5,"Storey, Mr. Thomas",0,male,0,NaN

Replace the NaN value of this row in the main *DataFrame* with the mean Fare for those corresponding with the same class and Embarked location using the groupby method